import {
  Aside,
  InfoPageWrapper,
  Main,
  StyledCommonWrapper,
} from "styles/CommonStyled";
import {
  AboutBookClub,
  Label,
  SubTitle,
  Text,
  Title,
  Wrapper,
} from "./BookClubPage.styled";
import Subscribe from "components/Subscribe";

const BookClubPage: React.FC = () => {
  return (
    <StyledCommonWrapper>
      <InfoPageWrapper>
        <Aside>
          <Label>Book Club</Label>
          {/* <Image src={images.placeholder} width="296" height="419" /> */}
        </Aside>
        <Main>
          <AboutBookClub>
            <Title>Ласкаво просимо до книжкового клубу Book Club!</Title>
            <Text>
              Book Club - це програма лояльності, створена спеціально для наших
              покупців. Ми цінуємо вашу вірність, тому пропонуємо вам унікальні
              можливості та переваги.
            </Text>

            <SubTitle>Як це працює?</SubTitle>
            <Text>
              Дуже просто! Кожен раз, коли ви робите покупку в нашому онлайн
              магазині на суму від 100 грн, ви отримуєте бонусні бали. Ці бали
              накопичуються на вашому обліковому записі і можуть бути
              використані для оплати нових замовлень. Кожна витрачена гривня
              принесе вам один бонусний бал.
            </Text>

            <SubTitle>Що ви отримуєте?</SubTitle>
            <Text>
              Перш за все, ви отримуєте можливість замовляти та отримувати нові
              видання книг у першу чергу. Ваш статус у нашому клубі надає вам
              пріоритетний доступ до найсвіжіших та найбільш очікуваних книжок.
            </Text>
            <Text>
              Крім того, ви можете використовувати накопичені бонусні бали для
              оплати частини або повної вартості вашого замовлення. Це чудовий
              спосіб економити на вашій улюбленій літературі та відкривати для
              себе ще більше нових авторів та жанрів.
            </Text>

            <SubTitle>Як приєднатися?</SubTitle>
            <Text>
              Для того щоб приєднатися до нашого книжкового клубу, достатньо
              зареєструватися на нашому сайті та здійснити першу покупку на суму
              від 100 грн. Після цього ви автоматично стаєте учасником програми
              лояльності та починаєте збирати бонусні бали.
            </Text>
            <Text>
              Не пропустіть можливість отримати ще більше задоволення від книг з
              Book Club! Реєструйтеся вже сьогодні та почніть насолоджуватися
              усіма перевагами нашої програми лояльності. Дякуємо за ваш вибір
              та довіру!
            </Text>
          </AboutBookClub>
        </Main>
        <Wrapper>
          <Subscribe />
        </Wrapper>
      </InfoPageWrapper>
    </StyledCommonWrapper>
  );
};

export default BookClubPage;
