import { Category } from "interface/interface";

const kids: Category[] = [
  {
    "Книги за віком": [
      "0-1 роки",
      "1-2 роки",
      "2-4 роки",
      "4-6 років",
      "6-8 років",
      "9-12 років",
      "13-15 років",
    ],
  },
  {
    "За тематикою": [
      "Казки",
      "Абетки, лічба",
      "Енциклопедії",
      "Вільмебухи",
      "Розмальовки",
      "Різдвяні, новорічні",
      "Навчальні, розвивальні",
      "Вірші",
      "Про динозаврів",
      "Про транспорт",
      "Фентезі та фантастика",
      "Детективи",
      "Комікси",
      "Про релігії",
      "Про психологію",
      "Про фізіологію",
    ],
  },
];

export default kids;
